---
type: ProjectBrowserOptions
namespace: Autodesk.Revit.UI
version: 2024
members: 4
tags: [revit-api, class]
---

# ProjectBrowserOptions

`Autodesk.Revit.UI.ProjectBrowserOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetProjectBrowserOptions | 2023 | `public static ProjectBrowserOptions GetProjectBrowserOptions ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ShowViewPlacementOnSheetStatusIcons | 2023 | `public bool ShowViewPlacementOnSheetStatusIcons { get ; set ; }` |